<template>
  <div class="page has-navbar" v-nav="{title: '条款', showBackButton: true}">
    <div class="page-content">
      <div v-if="false" class="clause-detail">
        <h3 class="clause-title">我是总则</h3>
        <ul>
          <li>1 总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则</li>
          <li>2 总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则</li>
          <li>3 总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则</li>
          <li>4 总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则总则</li>
        </ul>
      </div>
      <div v-if="false" class="clause-detail">
        <h3 class="clause-title">我是细则</h3>
        <ul>
          <li>1 细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则</li>
          <li>2 细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则</li>
          <li>3 细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则</li>
          <li>4 细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则细则</li>
        </ul>
      </div>
      <div class="clause-detail">
        <h2 class="clause-title">合作协议章程</h2>
        <ul>
          <li><span>甲方：</span><span></span></li>
          <li><span>身份证号码：</span><span></span></li>
          <li><span>地址：</span><span></span></li>
          <li><span>联系方式：</span><span></span></li>
          <li><span>QQ（微信）：</span><span></span></li>
        </ul>
        <hr>
        <ul>
          <li><span>乙方：</span><span></span></li>
          <li><span>地址：</span><span></span></li>
          <li><span>联系方式：</span><span></span></li>
        </ul>
        <hr>

        <p>经甲乙双方平等协商，乙方在自有平台推广过程中邀请甲方参与并为推广，双方本着互惠互利的原则，特此签署本协议。</p>
        <p class="txt-underline">本合同的有效期为<span></span>年，自<span></span>年<span
        ></span>月<span></span>日起至<span></span>年<span
        ></span>月<span></span>日止。
          协议到期后，在同等条件下，甲方有续签的优先权。</p>
        <h3>第一章 双方声明</h3>
        <p>1、双方协商确认甲方为 一米棋牌 的特约推广合作用户。</p>
        <p>2、经乙方审核确认甲方具备产品推广工作条件，并授权甲方负责协议产品的推广工作，乙方有义务协助甲方的推广工作，提供已知的推广方案。</p>
        <h3>第二章 合作模式</h3>
        <p>1、甲方以兼职的形式利用自己的身份和个人资源便利为产品进行线下的推广，拉动线下的玩家进入游戏并在游戏过程中进行互动，通过游戏玩家的消费进行相应的分成。</p>
        <p>2、甲方可以使用乙方提供的管理后台，发展属于自己推广用户，只要推广用户在游戏进行充值，这份充值甲方就会得到相应的分成，分成多少根据推广用户的充值，按照比例进行分配。</p>
        <p>3、甲方发展的推广用户只要绑定甲方在平台的推广码就算完成绑定，发展的推广用户会显示在对应的代理后台里，包括用户信息、充值金额 便于代理查看。</p>
        <h3>第三章 费用结算方式</h3>
        <p>1、甲方可在乙方提供的管理后台自行提款。</p>
        <p>2、甲方提款时务必填写自己真实的资料和与身份证号码相匹配的收款人账号和收款人信息以及联系方式。</p>
        <p>3、提款在1个工作日内进行结算，结算没有数额限制，甲方自行承担打款手续费和工商税点。</p>
        <h3>第四章 甲乙双方的权利与义务</h3>
        <h4>一、甲方权利义务</h4>
        <p>1、甲方负责对自己的营销手段进行严格管理，不从事违反国家法律、法规的活动或发布法律、法规禁止的信息和内容。如因此造成乙方或第三方损失的，甲方应当承担赔偿责任。</p>
        <p>
          2、甲方应在投放时注意保护乙方的品牌形象，严格按照乙方提供的方案进行推广（包括但不仅限于文案、图片等），如有自主创意修改须征得乙方负责人邮件正式同意才可执行。如甲方有自主修改的，甲方需保证其使用的图片、文字等未侵犯他人的知识产权，否则，由此给乙方或第三方造成损失的，甲方承担赔偿责任。</p>
        <p>3、未经乙方同意，甲方不得将本合同项下全部或部分权利、义务转让给他人。</p>
        <h4>二、乙方权利义务</h4>
        <p>1、乙方有权要求甲方按照合同约定进行推广，甲方应提供优质的资源，以提高推广质量。</p>
        <p>2、乙方保证推广产品和服务的合法经营性。</p>
        <p>3、乙方按照约定提供后台管理的使用说明和网络推广方案。</p>
        <p>4、乙方为推广活动提供实物奖品赞助。</p>

        <h3>第五章 争议纠纷</h3>
        <p>1、在协议履行过程中，各方若发生争议，应本着实事求是的精神及时协商解决。若各方不能达成协议时，任一方可向所在地人民法院提起诉讼。</p>

        <h3>第六章 协议的变更与终止</h3>
        <p>1、协议有效期届满，协议终止</p>
        <p>2、协议变更时，请甲乙双方协商达成一致，如有争议，任一方可向所在地人民法院提起诉讼。</p>
        <h3>第七章 其他条款</h3>
        <p>
          1.本协议附件与本协议具同等法律效力。本协议未约定事项，双方可视实际需要，依据相关法律规定，经双方协商达成一致后，签订补充协议。补充协议属于本协议的一部分，与本协议具有同等法律效力；如补充协议、附件与本协议条款有不同规定的，以补充协议、附件规定为准。</p>
        <p>2.未经对方事先书面同意，双方均不得将本协议所赋予的权利或义务全部或部分转让或以其他方式移转。</p>
        <div class="signature">
          <div class="fl left">
            <div>甲方（签字或盖章）：</div>
            <div>联系电话：</div>
            <div>签订日期：</div>
          </div>
          <div class="fr left">
            <div>乙方（签字或盖章）：</div>
            <div>联系电话：</div>
            <div>签订日期：</div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
  export default {
    name: 'clause',
    data () {
      return {
        msg: '111111'
      }
    },
    methods: {}
  }
</script>


<style scoped>
  .page-content {
    background-color: #fff;
  }

  p {
    text-indent: 2em;
  }

  .fl {
    float: left;
  }

  .fr {
    float: right;
  }

  .txt-underline span {
    text-decoration: underline;
  }

  .clause-detail {
    padding: 10px;
    overflow: auto;
  }

  .clause-title, h3, h4 {
    font-size: 16px;
    font-weight: bold;
    margin: 0;
    text-align: center;
  }

  h3 {
    text-align: left;
  }

  h4 {
    text-align: left;
    font-size: 14px;
  }

  .signature {
    overflow: hidden;
    padding-bottom: 20px;
    font-size: 14px;
  }

  .signature .left {
    width: 50%;
  }
</style>
